{
  "📅 August 2025 – Daily Current Affairs": {
    "📆 Current Affairs – August 7, 2025": [
      {
        "questionText": "What does 'bond switching' refer to in the context of government debt management?",
        "options": [
          "Converting foreign currency bonds into domestic currency",
          "Issuing zero-coupon bonds in place of treasury bills",
          "Replacing short-term sovereign bonds with long-duration ones",
          "Buying back bonds before maturity at a discounted rate"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Bond switching is a debt management mechanism through which the government replaces existing shorter-duration sovereign bonds with long-duration papers. This helps reduce refinancing risk and manage future repayment pressure."
      },
      {
        "questionText": "According to a study by Bank of Baroda, how much did the Indian government save through bond switching?",
        "options": [
          "Rs 1,200 crore",
          "Rs 560 crore",
          "Rs 300 crore",
          "Rs 950 crore"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Bank of Baroda study highlighted that bond switching helped the Government of India save Rs 560 crore in interest costs, even as overall debt maturity was rising."
      },
      {
        "questionText": "Which of the following is an example of bond switching?",
        "options": [
          "Issuing new bonds to replace maturing external commercial borrowings",
          "Converting rupee-denominated bonds into dollar-denominated bonds",
          "Swapping fixed interest bonds with floating interest bonds",
          "Replacing FY27–FY29 maturing bonds with bonds maturing post-FY32"
        ],
        "correctAnswerIndex": 3,
        "explanation": "An example of bond switching is when bonds maturing in FY27, FY28, and FY29 are replaced with those maturing after FY32. This spreads out repayment obligations and avoids a near-term debt pile-up."
      },
      {
        "questionText": "What is one major objective of bond switching carried out by the Indian government?",
        "options": [
          "To generate short-term capital gains",
          "To ensure development of the corporate bond market",
          "To smoothen the government's liability profile",
          "To boost foreign direct investment in the bond market"
        ],
        "correctAnswerIndex": 2,
        "explanation": "One major objective of bond switching is to smoothen the government’s liability profile. By extending maturities, the government can better manage when repayments fall due, ensuring long-term fiscal stability."
      },
      {
        "questionText": "Who are the parties typically involved in the bond switching process?",
        "options": [
          "Market participants or the Reserve Bank of India",
          "International Monetary Fund (IMF) and World Bank",
          "Only retail investors through stock exchanges",
          "Only private commercial banks"
        ],
        "correctAnswerIndex": 0,
        "explanation": "Bond switching operations are carried out either with market participants such as institutional investors or directly with the Reserve Bank of India (RBI), which acts as the government’s debt manager."
      },
      {
        "questionText": "Which of the following is NOT a purpose of bond switching?",
        "options": [
          "To manage repayment burden over time",
          "To support development of the bond market",
          "To reduce near-term refinancing risks",
          "To provide direct tax rebates to bondholders"
        ],
        "correctAnswerIndex": 3,
        "explanation": "Bond switching is not intended to provide tax rebates to bondholders. Its main purposes include managing debt maturity profiles, reducing refinancing risks, and supporting overall market development."
      },
      {
        "questionText": "Why is switching to long-duration bonds considered beneficial during rising debt maturity?",
        "options": [
          "It allows the government to invest in foreign sovereign bonds",
          "It reduces the overall amount of interest paid annually",
          "It postpones repayments, easing immediate fiscal pressure",
          "It increases returns for corporate bondholders"
        ],
        "correctAnswerIndex": 2,
        "explanation": "By switching to long-duration bonds, the government spreads repayment obligations over a longer time horizon, thereby reducing annual debt servicing pressure and allowing better fiscal planning."
      },
      {
        "questionText": "What is the main aim of the PAN 2.0 project launched by the Income Tax Department?",
        "options": [
          "To streamline and modernise the process of issuing and managing PAN and TAN",
          "To replace PAN with Aadhaar for tax filing",
          "To introduce a new tax regime for digital assets",
          "To centralise income tax returns across states"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The PAN 2.0 project aims to streamline and modernise the process of issuing and managing PAN (Permanent Account Number) and TAN (Tax Deduction and Collection Account Number), using a single portal, paperless processing, and enhanced security features like PAN Data Vault."
      },
      {
        "questionText": "Which of the following statements about the Asian Giant Tortoise is correct?",
        "options": [
          "It is classified as Vulnerable under IUCN Red List",
          "It nests underground like most tortoises",
          "It is commonly found in Singapore",
          "It is the largest tortoise in mainland Asia and builds nests above ground"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Asian Giant Tortoise is the largest tortoise in mainland Asia and uniquely builds its nest above the ground, unlike most tortoises. It is critically endangered and has been reintroduced in Zeliang Community Reserve in Nagaland."
      },
      {
        "questionText": "According to the recent Supreme Court judgment, what power do Pollution Control Boards (PCBs) have under the Water and Air Acts?",
        "options": [
          "They can impose environmental compensation only through court orders",
          "They can impose penalties for any contravention regardless of damage",
          "They can impose environmental compensation under Sections 33A (Water Act) and 31A (Air Act) when environmental harm is caused",
          "They can recommend only preventive measures, not punitive action"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Supreme Court upheld that Pollution Control Boards (PCBs) can impose environmental compensation when environmental damage has been caused, exercising their powers under Section 33A of the Water Act, 1974 and Section 31A of the Air Act, 1981. This reinforces the Polluter Pays principle."
      },
      {
        "questionText": "What is the primary role of the International Financial Services Centres Authority (IFSCA) in India?",
        "options": [
          "To regulate cooperative banks and NBFCs across India",
          "To supervise the taxation system in Special Economic Zones (SEZs)",
          "To regulate financial products, services, and institutions in IFSCs",
          "To oversee foreign portfolio investments and their taxation"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The IFSCA, established under the IFSCA Act, 2019, is the unified regulator for all financial products, services, and institutions within India's International Financial Services Centres (IFSCs), such as GIFT City IFSC."
      },
      {
        "questionText": "Which of the following best describes the function of GIFT City IFSC?",
        "options": [
          "To handle rural banking and agricultural subsidies",
          "To facilitate foreign currency financial services for residents and non-residents",
          "To provide tax-free investment zones for retail investors",
          "To act as a central hub for SEBI and RBI operations"
        ],
        "correctAnswerIndex": 1,
        "explanation": "GIFT City IFSC is India’s only International Financial Services Centre, established in a Special Economic Zone in Gujarat. It facilitates both onshore and offshore financial services in foreign currency for residents (institutions) and non-residents."
      },
      {
        "questionText": "What is the primary aim of establishing satellite financial innovation zones in major metro cities as per the Standing Committee on Finance?",
        "options": [
          "To promote inclusive growth, create talent pools, and attract diverse investors",
          "To centralise all financial regulatory powers under the RBI",
          "To improve agricultural credit distribution",
          "To facilitate digital wallets and UPI-only banking systems"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The committee recommends satellite fintech clusters in metros to encourage inclusive growth, create region-specific models, nurture talent pools, and attract investors, similar to China's multiple financial hubs."
      },
      {
        "questionText": "What is the core objective of the AGNISHODH research centre recently inaugurated at IIT Madras in collaboration with the Indian Army?",
        "options": [
          "To study nuclear reactor designs for submarines",
          "To convert lab-scale defence innovations into deployable technologies",
          "To promote international military cooperation in cyber warfare",
          "To produce heavy artillery and ordnance systems"
        ],
        "correctAnswerIndex": 1,
        "explanation": "AGNISHODH aims to convert defence innovations from lab-scale to field-deployable technologies, advancing self-reliance and modernisation in India’s military, with a focus on non-kinetic warfare and emerging tech domains like AI and space."
      },
      {
        "questionText": "Which of the following initiatives under India’s defence modernisation aims to support startups and innovators?",
        "options": [
          "SRIJAN",
          "iDEX",
          "AGNISHODH",
          "MAKE-I"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Innovations for Defence Excellence (iDEX) initiative, launched in 2018, engages startups, MSMEs, academia, and individuals in developing defence technologies. It includes sub-schemes like ADITI for nurturing innovation in defence."
      },
      {
        "questionText": "Why was the recent visit of the Prime Minister of India to Cyprus significant?",
        "options": [
          "It marked the signing of a free trade agreement",
          "It launched India's first overseas military base",
          "It commemorated the centenary of India-Cyprus relations",
          "It was the first Prime Ministerial visit in 23 years"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Prime Minister's visit to Cyprus was significant because it was the first such visit in 23 years, highlighting renewed diplomatic engagement between the two countries."
      },
      {
        "questionText": "What key recommendation did the Parliamentary Standing Committee on Finance make regarding ESG in India?",
        "options": [
          "Dissolution of the CSR framework under Companies Act",
          "Formation of an independent ESG Oversight Body under MCA",
          "Making ESG disclosures optional for listed companies",
          "Delegating ESG monitoring to SEBI exclusively"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The committee recommended the creation of a dedicated ESG Oversight Body under the Ministry of Corporate Affairs (MCA) to monitor ESG disclosures, ensure compliance, and penalize greenwashing practices."
      },
      {
        "questionText": "What is 'greenwashing' as mentioned in the context of ESG regulations?",
        "options": [
          "A method to reduce industrial carbon emissions",
          "A technique to recycle wastewater in green factories",
          "Misleading representation of a company's environmental practices",
          "The practice of planting trees around factories"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Greenwashing refers to the act of misleading consumers or stakeholders about the environmental practices or sustainability of a company, often by exaggerating or falsifying ESG claims."
      },
      {
        "questionText": "According to NITI Aayog’s new EV report, what financing reform is proposed to support electric mobility?",
        "options": [
          "Complete subsidy on EV purchases for all citizens",
          "Waiving toll tax for EVs nationwide",
          "Mandating all government vehicles be electric by 2026",
          "Providing low-interest loans and exploring battery leasing models"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The report recommends offering lower-interest loans for electric buses and trucks and exploring battery and vehicle leasing models to convert high upfront costs into manageable operating expenses."
      },
      {
        "questionText": "What does the India Electric Mobility Index (IEMI) primarily assess?",
        "options": [
          "Cost efficiency of EV manufacturing",
          "State-wise progress on EV adoption, infrastructure, and innovation",
          "Foreign direct investment in the EV sector",
          "Pollution levels due to EV batteries"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The India Electric Mobility Index (IEMI), developed by NITI Aayog and WRI India, evaluates state-level progress in EV adoption, charging infrastructure readiness, and research & innovation across 16 indicators."
      }
    ]
  }
}
