{
  "📅 August 2025 – Daily Current Affairs":{
    "📆 Current Affairs – August 7, 2025": [
      {
        "questionText": "What does 'bond switching' refer to in the context of government debt management?",
        "options": [
          "Converting foreign currency bonds into domestic currency",
          "Issuing zero-coupon bonds in place of treasury bills",
          "Replacing short-term sovereign bonds with long-duration ones",
          "Buying back bonds before maturity at a discounted rate"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Bond switching is a debt management mechanism through which the government replaces existing shorter-duration sovereign bonds with long-duration papers. This helps reduce refinancing risk and manage future repayment pressure."
      },
      {
        "questionText": "According to a study by Bank of Baroda, how much did the Indian government save through bond switching?",
        "options": [
          "Rs 1,200 crore",
          "Rs 560 crore",
          "Rs 300 crore",
          "Rs 950 crore"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Bank of Baroda study highlighted that bond switching helped the Government of India save Rs 560 crore in interest costs, even as overall debt maturity was rising."
      },
      {
        "questionText": "Which of the following is an example of bond switching?",
        "options": [
          "Issuing new bonds to replace maturing external commercial borrowings",
          "Converting rupee-denominated bonds into dollar-denominated bonds",
          "Swapping fixed interest bonds with floating interest bonds",
          "Replacing FY27–FY29 maturing bonds with bonds maturing post-FY32"
        ],
        "correctAnswerIndex": 3,
        "explanation": "An example of bond switching is when bonds maturing in FY27, FY28, and FY29 are replaced with those maturing after FY32. This spreads out repayment obligations and avoids a near-term debt pile-up."
      },
      {
        "questionText": "What is one major objective of bond switching carried out by the Indian government?",
        "options": [
          "To generate short-term capital gains",
          "To ensure development of the corporate bond market",
          "To smoothen the government's liability profile",
          "To boost foreign direct investment in the bond market"
        ],
        "correctAnswerIndex": 2,
        "explanation": "One major objective of bond switching is to smoothen the government’s liability profile. By extending maturities, the government can better manage when repayments fall due, ensuring long-term fiscal stability."
      },
      {
        "questionText": "Who are the parties typically involved in the bond switching process?",
        "options": [
          "Market participants or the Reserve Bank of India",
          "International Monetary Fund (IMF) and World Bank",
          "Only retail investors through stock exchanges",
          "Only private commercial banks"
        ],
        "correctAnswerIndex": 0,
        "explanation": "Bond switching operations are carried out either with market participants such as institutional investors or directly with the Reserve Bank of India (RBI), which acts as the government’s debt manager."
      },
      {
        "questionText": "Which of the following is NOT a purpose of bond switching?",
        "options": [
          "To manage repayment burden over time",
          "To support development of the bond market",
          "To reduce near-term refinancing risks",
          "To provide direct tax rebates to bondholders"
        ],
        "correctAnswerIndex": 3,
        "explanation": "Bond switching is not intended to provide tax rebates to bondholders. Its main purposes include managing debt maturity profiles, reducing refinancing risks, and supporting overall market development."
      },
      {
        "questionText": "Why is switching to long-duration bonds considered beneficial during rising debt maturity?",
        "options": [
          "It allows the government to invest in foreign sovereign bonds",
          "It reduces the overall amount of interest paid annually",
          "It postpones repayments, easing immediate fiscal pressure",
          "It increases returns for corporate bondholders"
        ],
        "correctAnswerIndex": 2,
        "explanation": "By switching to long-duration bonds, the government spreads repayment obligations over a longer time horizon, thereby reducing annual debt servicing pressure and allowing better fiscal planning."
      },
      {
        "questionText": "What is the main aim of the PAN 2.0 project launched by the Income Tax Department?",
        "options": [
          "To streamline and modernise the process of issuing and managing PAN and TAN",
          "To replace PAN with Aadhaar for tax filing",
          "To introduce a new tax regime for digital assets",
          "To centralise income tax returns across states"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The PAN 2.0 project aims to streamline and modernise the process of issuing and managing PAN (Permanent Account Number) and TAN (Tax Deduction and Collection Account Number), using a single portal, paperless processing, and enhanced security features like PAN Data Vault."
      },
      {
        "questionText": "Which of the following statements about the Asian Giant Tortoise is correct?",
        "options": [
          "It is classified as Vulnerable under IUCN Red List",
          "It nests underground like most tortoises",
          "It is commonly found in Singapore",
          "It is the largest tortoise in mainland Asia and builds nests above ground"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Asian Giant Tortoise is the largest tortoise in mainland Asia and uniquely builds its nest above the ground, unlike most tortoises. It is critically endangered and has been reintroduced in Zeliang Community Reserve in Nagaland."
      },
      {
        "questionText": "According to the recent Supreme Court judgment, what power do Pollution Control Boards (PCBs) have under the Water and Air Acts?",
        "options": [
          "They can impose environmental compensation only through court orders",
          "They can impose penalties for any contravention regardless of damage",
          "They can impose environmental compensation under Sections 33A (Water Act) and 31A (Air Act) when environmental harm is caused",
          "They can recommend only preventive measures, not punitive action"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Supreme Court upheld that Pollution Control Boards (PCBs) can impose environmental compensation when environmental damage has been caused, exercising their powers under Section 33A of the Water Act, 1974 and Section 31A of the Air Act, 1981. This reinforces the Polluter Pays principle."
      },
      {
        "questionText": "What is the primary role of the International Financial Services Centres Authority (IFSCA) in India?",
        "options": [
          "To regulate cooperative banks and NBFCs across India",
          "To supervise the taxation system in Special Economic Zones (SEZs)",
          "To regulate financial products, services, and institutions in IFSCs",
          "To oversee foreign portfolio investments and their taxation"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The IFSCA, established under the IFSCA Act, 2019, is the unified regulator for all financial products, services, and institutions within India's International Financial Services Centres (IFSCs), such as GIFT City IFSC."
      },
      {
        "questionText": "Which of the following best describes the function of GIFT City IFSC?",
        "options": [
          "To handle rural banking and agricultural subsidies",
          "To facilitate foreign currency financial services for residents and non-residents",
          "To provide tax-free investment zones for retail investors",
          "To act as a central hub for SEBI and RBI operations"
        ],
        "correctAnswerIndex": 1,
        "explanation": "GIFT City IFSC is India’s only International Financial Services Centre, established in a Special Economic Zone in Gujarat. It facilitates both onshore and offshore financial services in foreign currency for residents (institutions) and non-residents."
      },
      {
        "questionText": "What is the primary aim of establishing satellite financial innovation zones in major metro cities as per the Standing Committee on Finance?",
        "options": [
          "To promote inclusive growth, create talent pools, and attract diverse investors",
          "To centralise all financial regulatory powers under the RBI",
          "To improve agricultural credit distribution",
          "To facilitate digital wallets and UPI-only banking systems"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The committee recommends satellite fintech clusters in metros to encourage inclusive growth, create region-specific models, nurture talent pools, and attract investors, similar to China's multiple financial hubs."
      },
      {
        "questionText": "What is the core objective of the AGNISHODH research centre recently inaugurated at IIT Madras in collaboration with the Indian Army?",
        "options": [
          "To study nuclear reactor designs for submarines",
          "To convert lab-scale defence innovations into deployable technologies",
          "To promote international military cooperation in cyber warfare",
          "To produce heavy artillery and ordnance systems"
        ],
        "correctAnswerIndex": 1,
        "explanation": "AGNISHODH aims to convert defence innovations from lab-scale to field-deployable technologies, advancing self-reliance and modernisation in India’s military, with a focus on non-kinetic warfare and emerging tech domains like AI and space."
      },
      {
        "questionText": "Which of the following initiatives under India’s defence modernisation aims to support startups and innovators?",
        "options": [
          "SRIJAN",
          "iDEX",
          "AGNISHODH",
          "MAKE-I"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Innovations for Defence Excellence (iDEX) initiative, launched in 2018, engages startups, MSMEs, academia, and individuals in developing defence technologies. It includes sub-schemes like ADITI for nurturing innovation in defence."
      },
      {
        "questionText": "Why was the recent visit of the Prime Minister of India to Cyprus significant?",
        "options": [
          "It marked the signing of a free trade agreement",
          "It launched India's first overseas military base",
          "It commemorated the centenary of India-Cyprus relations",
          "It was the first Prime Ministerial visit in 23 years"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Prime Minister's visit to Cyprus was significant because it was the first such visit in 23 years, highlighting renewed diplomatic engagement between the two countries."
      },
      {
        "questionText": "What key recommendation did the Parliamentary Standing Committee on Finance make regarding ESG in India?",
        "options": [
          "Dissolution of the CSR framework under Companies Act",
          "Formation of an independent ESG Oversight Body under MCA",
          "Making ESG disclosures optional for listed companies",
          "Delegating ESG monitoring to SEBI exclusively"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The committee recommended the creation of a dedicated ESG Oversight Body under the Ministry of Corporate Affairs (MCA) to monitor ESG disclosures, ensure compliance, and penalize greenwashing practices."
      },
      {
        "questionText": "What is 'greenwashing' as mentioned in the context of ESG regulations?",
        "options": [
          "A method to reduce industrial carbon emissions",
          "A technique to recycle wastewater in green factories",
          "Misleading representation of a company's environmental practices",
          "The practice of planting trees around factories"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Greenwashing refers to the act of misleading consumers or stakeholders about the environmental practices or sustainability of a company, often by exaggerating or falsifying ESG claims."
      },
      {
        "questionText": "According to NITI Aayog’s new EV report, what financing reform is proposed to support electric mobility?",
        "options": [
          "Complete subsidy on EV purchases for all citizens",
          "Waiving toll tax for EVs nationwide",
          "Mandating all government vehicles be electric by 2026",
          "Providing low-interest loans and exploring battery leasing models"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The report recommends offering lower-interest loans for electric buses and trucks and exploring battery and vehicle leasing models to convert high upfront costs into manageable operating expenses."
      },
      {
        "questionText": "What does the India Electric Mobility Index (IEMI) primarily assess?",
        "options": [
          "Cost efficiency of EV manufacturing",
          "State-wise progress on EV adoption, infrastructure, and innovation",
          "Foreign direct investment in the EV sector",
          "Pollution levels due to EV batteries"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The India Electric Mobility Index (IEMI), developed by NITI Aayog and WRI India, evaluates state-level progress in EV adoption, charging infrastructure readiness, and research & innovation across 16 indicators."
      }
    ],
    "📆 Current Affairs – August 5, 2025": [
    {
      "questionText": "What is the purpose of the newly developed District Flood Severity Index (DFSI) by IIT Delhi and IIT Gandhinagar?",
      "options": [
        "To map earthquake zones at the block level",
        "To monitor rainfall for agricultural planning",
        "To quantify and assess flood severity at the district level",
        "To predict cyclonic disturbances across India"
      ],
      "correctAnswerIndex": 2,
      "explanation": "The District Flood Severity Index (DFSI) is a scientific tool developed by IIT Delhi and IIT Gandhinagar researchers to quantify flood severity at the district level, which is the core administrative unit for disaster planning in India. The composite DFSI includes six factors grouped under flood occurrence (number of events, flood duration, flooded area, population affected) and flood damage (human fatalities and number of people injured). It is designed to aid policymakers in prioritizing disaster management and resource allocation based on scientific data."
    },
    {
      "questionText": "Which of the following variables is NOT part of the District Flood Severity Index (DFSI)?",
      "options": [
        "Rainwater pH levels",
        "Flooded area",
        "Mean flood duration",
        "Human fatalities"
      ],
      "correctAnswerIndex": 0,
      "explanation": "Rainwater pH levels are not a component of the DFSI. The DFSI is composed of six scientifically selected variables that reflect both the occurrence and damage caused by floods: number of flood events, average duration of floods, area flooded, population affected, number of human fatalities, and injuries. It focuses on quantifiable indicators of flood impact rather than chemical characteristics of rainfall."
    },
    {
      "questionText": "What is the significance of the Notch signaling pathway recently synthetically engineered by Harvard scientists?",
      "options": [
        "It plays a critical role in cell communication, development, and disease prevention",
        "It regulates photosynthesis in plants",
        "It is a hormonal feedback system in birds",
        "It is involved in nutrient absorption in the intestines"
      ],
      "correctAnswerIndex": 0,
      "explanation": "Notch signaling is a crucial cell-to-cell communication system found in multicellular organisms. It helps maintain tissue homeostasis and governs key processes such as cell fate determination, proliferation, differentiation, and programmed cell death (apoptosis). Disruptions in this pathway are associated with developmental disorders and diseases like cancer. The synthetic activator created by Harvard scientists opens new research avenues for regenerative medicine and targeted therapy."
    },
    {
      "questionText": "What are 'Cold Pools' as discussed in a recent University of Washington study on ocean and rainfall interactions?",
      "options": [
        "Deep ocean currents responsible for marine cooling",
        "Artificially cooled aquifers used in agriculture",
        "Frozen water bodies in polar regions",
        "Shallow, dense, cool air masses formed beneath storm clouds due to rain evaporation"
      ],
      "correctAnswerIndex": 3,
      "explanation": "Cold pools are small-scale, shallow regions of cool air that form near the surface beneath rain-producing clouds. This cool air results from partial evaporation of raindrops, which absorbs heat and lowers the temperature of the surrounding air. The cooled air becomes denser and sinks, spreading outward as a ‘cold bubble’. Cold pools are important in meteorology because they affect the stability of the atmosphere and the development of new storms."
    },
    {
      "questionText": "Which of the following statements about the Sharada script is TRUE, as highlighted during the Chinar Book Festival?",
      "options": [
        "It was developed in the 18th century and used for writing Urdu.",
        "It is a Brahmic script used for writing Sanskrit, flourishing between the 8th and 9th centuries.",
        "It originated in Tamil Nadu and was used exclusively by Buddhists.",
        "It is a modern script designed for digital Sanskrit literature."
      ],
      "correctAnswerIndex": 1,
      "explanation": "The Sharada script is an ancient script derived from the Brahmic family of writing systems. It originated in Kashmir and was prominently used between the 8th and 9th centuries AD, mainly for writing Sanskrit. It later spread to Himachal Pradesh and Punjab. Though very few manuscripts have survived, the script holds cultural and historical significance, especially among Kashmiri Pandits. Its inscriptions have also been found as far as Afghanistan on statues and sculptures, highlighting its broad influence."
    },
      {
        "questionText": "Why was the Mahanadi Water Disputes Tribunal (MWDT) constituted in 2018?",
        "options": [
          "To resolve water pollution in the Mahanadi basin",
          "To facilitate hydropower development on the river",
          "To settle a water-sharing dispute between Odisha and Chhattisgarh over construction of barrages",
          "To monitor flood control systems in the delta region"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Mahanadi Water Disputes Tribunal was constituted in 2018 under the Inter-State River Water Disputes Act, 1956. Odisha, the lower riparian state, alleged that Chhattisgarh had unilaterally constructed several barrages in the upper catchment areas, leading to reduced water flow during non-monsoon seasons. The Tribunal was set up to adjudicate the matter under constitutional provisions like Article 262 and relevant laws."
      },
      {
        "questionText": "What is the main objective of ISRO's HOPE (Himalayan Outpost for Planetary Exploration) Analog Mission?",
        "options": [
          "To launch satellites into low-Earth orbit",
          "To simulate extraterrestrial conditions on Earth for space research and human survival training",
          "To monitor Himalayan glacier melting through satellites",
          "To test missile systems in high-altitude terrain"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The HOPE Analog Mission, launched by ISRO in Tso Kar Valley, Ladakh, is designed to simulate extraterrestrial environments like those on Mars and the Moon. It enables testing of human survival, health protocols, microbial analysis, and space operation techniques. The station provides space-like conditions for testing equipment and researching astronaut health, making it a vital step toward long-term human missions beyond Earth."
      },
      {
        "questionText": "Which unique environmental features made Tso Kar Valley an ideal location for ISRO’s HOPE station?",
        "options": [
          "High forest cover and biodiversity",
          "Tropical climate with steady rainfall",
          "Low atmospheric pressure, high UV radiation, and saline permafrost",
          "Proximity to urban centers and transport hubs"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Tso Kar Valley in Ladakh was selected for the HOPE analog station due to its Mars-like conditions: extreme cold, high ultraviolet radiation, low atmospheric pressure, and saline permafrost. These conditions mimic those found on extraterrestrial bodies and support astrobiological and technological experimentation relevant to future interplanetary missions."
      },
      {
        "questionText": "Which river system is the Kopili River a tributary of, and which states does it flow through?",
        "options": [
          "Brahmaputra; Meghalaya and Assam",
          "Godavari; Andhra Pradesh and Telangana",
          "Yamuna; Uttar Pradesh and Haryana",
          "Ganga; Bihar and West Bengal"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The Kopili River is a significant left-bank tributary of the Brahmaputra River. It originates in the Saipong Reserve Forest in southeast Meghalaya and flows through Assam. Recently, the National Waterway-57 on the Kopili River was operationalized as part of India’s push for inland water transport under Maritime India Vision 2030 and PM Gati Shakti."
      },
      {
        "questionText": "What is the primary goal of the 'Matri Van' initiative launched in the Aravalli hills of Gurugram?",
        "options": [
          "To restore native biodiversity and create a large-scale urban forest",
          "To promote tourism through new forest resorts",
          "To develop monoculture tree plantations for timber",
          "To build a new industrial zone with green buffers"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The 'Matri Van' initiative aims to develop a 750-acre urban forest in the Aravalli hills as part of the ‘Ek Ped Maa Ke Naam’ programme. It focuses on ecological restoration, including removal of invasive species, planting native trees, and reviving Aravalli-specific biodiversity. The project fosters urban sustainability and community engagement in environmental conservation."
      },
      {
        "questionText": "What percentage of India's total fish production is contributed by the inland fisheries sector?",
        "options": [
          "45%",
          "75%",
          "60%",
          "85%"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Inland fisheries account for approximately 75% of India's total fish production. This includes fish harvested from rivers, ponds, lakes, reservoirs, and other inland water bodies. While marine fishing is a shared responsibility of the Centre and coastal states, the inland sector is primarily managed by state governments."
      },
      {
        "questionText": "Which of the following best defines a transgender person as per the Transgender Persons (Protection of Rights) Act, 2019?",
        "options": [
          "A person who has undergone sex reassignment surgery",
          "A person whose gender identity does not align with the gender assigned at birth",
          "A person who identifies as both male and female simultaneously",
          "Any person not falling under the binary gender category"
        ],
        "correctAnswerIndex": 1,
        "explanation": "According to the Transgender Persons (Protection of Rights) Act, 2019, a transgender person is someone whose gender identity does not match the gender assigned at birth. This includes a wide spectrum of identities, not limited to those who have undergone medical procedures."
      },
      {
        "questionText": "Which scheme provides comprehensive support for the livelihood and welfare of transgender individuals in India?",
        "options": [
          "PM-DAKSH Scheme",
          "Garima Grehas Yojana",
          "SMILE Scheme",
          "Gender Inclusion Fund"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The SMILE Scheme (Support for Marginalized Individuals for Livelihood and Enterprise) is a central government initiative specifically focused on the welfare of transgender individuals. It encompasses housing, livelihood, skill development, and social protection support. Other initiatives like PM-DAKSH and Garima Grehas complement SMILE but are narrower in scope."
      },
      {
        "questionText": "India recently endorsed the Regional Plan of Action to address IUU fishing in cooperation with which countries?",
        "options": [
          "Sri Lanka, Maldives, and Indonesia",
          "Bangladesh, Myanmar, and Thailand",
          "Sri Lanka, Bangladesh, and Maldives",
          "Nepal, Bhutan, and Bangladesh"
        ],
        "correctAnswerIndex": 2,
        "explanation": "India, along with Sri Lanka, Bangladesh, and Maldives, endorsed the Regional Plan of Action on IUU (Illegal, Unreported, and Unregulated) Fishing in the Bay of Bengal. This is part of India’s commitment to sustainable fishing practices and marine conservation through international collaboration."
      },
      {
        "questionText": "Which recent initiative was announced in the Union Budget 2025–26 with the highest-ever budgetary allocation to boost the fisheries sector?",
        "options": [
          "Blue Revolution 2.0",
          "Fisheries and Aquaculture Infrastructure Development Fund (FIDF)",
          "National Marine Resource Mission",
          "Pradhan Mantri Matsya Kisan Samridhi Sah-Yojana"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Pradhan Mantri Matsya Kisan Samridhi Sah-Yojana, a central sector sub-scheme under PMMSY, received the highest-ever total annual budgetary support in the Union Budget 2025–26. It aims to enhance income of fish farmers and strengthen fisheries infrastructure in alignment with the blue economy goals."
      },
      {
        "questionText": "India ranks third globally in total organ transplants in 2024. Which two countries surpass India in this regard?",
        "options": [
          "USA and China",
          "China and Germany",
          "USA and Spain",
          "China and Brazil"
        ],
        "correctAnswerIndex": 0,
        "explanation": "As of 2024, India is the third-highest country globally in terms of total organ transplants, following the United States and China. However, India leads the world in the number of living donor transplants."
      },
      {
        "questionText": "Which legislation governs organ donation and transplantation in India?",
        "options": [
          "Human Body Donation Act, 2005",
          "National Organ Donation and Transplantation Regulation Act, 2000",
          "Organ Sharing and Transplantation Act, 2011",
          "Transplantation of Human Organs and Tissues Act, 1994"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Transplantation of Human Organs and Tissues Act, 1994 (amended in 2011), introduced by the Ministry of Health and Family Welfare, regulates the removal, storage, and transplantation of human organs and prohibits commercial dealings in human organs."
      },
      {
        "questionText": "What is the objective of the recently amended Vegetable Oil Products Production and Availability (Regulation) Order, 2011?",
        "options": [
          "To increase vegetable oil exports",
          "To control the pricing of non-edible oils",
          "To promote organic oilseed farming",
          "To enhance transparency and ensure fair prices in the edible oil sector"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The amendment to the 2011 Order under the Essential Commodities Act, 1955 aims to bring transparency, prevent supply disruptions, and ensure fair prices in the edible oil industry. It also seeks to stabilize supplies and enhance accountability."
      },
      {
        "questionText": "Which three oilseeds contribute to over 92% of India’s total oilseed production?",
        "options": [
          "Sesame, soybean, castor",
          "Soybean, rapeseed & mustard, groundnut",
          "Sunflower, safflower, Nigerseed",
          "Rapeseed, linseed, safflower"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Soybean (34%), rapeseed & mustard (31%), and groundnut (27%) together make up over 92% of India's total oilseed production. These three crops dominate India's oilseed basket and are crucial for edible oil production."
      },
      {
        "questionText": "Which government campaign was launched in 2024 to promote organ donation awareness?",
        "options": [
          "Donate Life Movement",
          "Angdaan Jan Jagrukta Abhiyan",
          "Jeevan Daan Mission",
          "Swasth Jeevan Organ Drive"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The 'Angdaan Jan Jagrukta Abhiyan' was launched in 2024 as a nationwide campaign to spread awareness about organ donation and encourage more citizens to pledge organs. This initiative complements other reforms like Aadhaar-linked pledge portals and removal of state domicile restrictions."
      }
  ],
    "📆 Current Affairs – August 4, 2025": [
      {
        "questionText": "Which country recently became the 99th member of the International Solar Alliance (ISA)?",
        "options": [
          "Norway",
          "Chile",
          "Spain",
          "Uzbekistan"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Argentina became the 99th country to join the International Solar Alliance (ISA), an initiative co-launched by India and France in 2015 to promote solar energy and sustainable development. The alliance aims to mobilize over $1 trillion in investments by 2030 to scale up solar power globally."
      },
      {
        "questionText": "What is the recently launched 'UDAN 5.3' initiative focused on?",
        "options": [
          "Boosting metro rail connectivity in Tier-1 cities",
          "Expanding regional air connectivity in northeastern India",
          "Promoting underwater tourism",
          "Subsidizing electric vehicle manufacturing in rural areas"
        ],
        "correctAnswerIndex": 1,
        "explanation": "UDAN 5.3 is the latest round under the 'Ude Desh ka Aam Nagrik' (UDAN) scheme that targets improving regional air connectivity, especially in the North-Eastern states. It incentivizes airlines to operate flights in underserved and remote areas by offering financial subsidies and infrastructure support."
      },
      {
        "questionText": "Which Indian airport recently became the first to be fully powered by green hydrogen?",
        "options": [
          "Rajiv Gandhi International Airport, Hyderabad",
          "Indira Gandhi International Airport, Delhi",
          "Kempegowda International Airport, Bengaluru",
          "Cochin International Airport"
        ],
        "correctAnswerIndex": 3,
        "explanation": "Cochin International Airport has become the first in India to operate entirely on green hydrogen, marking a significant step towards decarbonization in the aviation sector. It previously gained recognition as the world’s first fully solar-powered airport and continues to lead in sustainability efforts."
      },
      {
        "questionText": "Who has been appointed as the new Chairperson of the National Human Rights Commission (NHRC) in August 2025?",
        "options": [
          "Justice Ranjan Gogoi",
          "Justice Sharad Arvind Bobde",
          "Justice Uday Umesh Lalit",
          "Justice Vineet Saran"
        ],
        "correctAnswerIndex": 3,
        "explanation": "Justice Vineet Saran, former Supreme Court judge, was appointed as the Chairperson of the NHRC in August 2025. The NHRC was established in 1993 under the Protection of Human Rights Act and serves as a watchdog for the protection and promotion of human rights in India."
      },
      {
        "questionText": "According to the India Meteorological Department (IMD), what notable weather pattern was observed in July 2025?",
        "options": [
          "Lowest average rainfall since 1950",
          "Hottest July recorded in 122 years",
          "Highest snowfall in Himalayan regions",
          "First recorded July tornado in India"
        ],
        "correctAnswerIndex": 1,
        "explanation": "IMD reported that July 2025 was the hottest recorded July in India in the last 122 years, with average maximum temperatures exceeding previous records. This extreme heat is attributed to prolonged dry spells and intensified El Niño conditions impacting the Indian subcontinent."
      },
      {
        "questionText": "Which state government has announced insurance coverage for 'Govindas' participating in Dahi Handi festival?",
        "options": [
          "Uttar Pradesh",
          "Maharashtra",
          "Gujarat",
          "Rajasthan"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Maharashtra government has announced insurance coverage for 'Govindas' (participants in the Dahi Handi festival). Each participant will be insured for ₹1.5 lakh, with a premium of ₹75 per Govinda. This move aims to provide safety and financial support to festival participants involved in the risky human pyramid event."
      },
      {
        "questionText": "Who has become the first woman Director General of the Railway Protection Force (RPF)?",
        "options": [
          "Ritu Bhatia",
          "Sonali Mishra",
          "Nisha Biswas",
          "Anita Sharma"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Sonali Mishra, an IPS officer of the 1993 batch, has been appointed as the first woman Director General of the RPF in its 143-year history. Her appointment is valid until October 2026, marking a significant milestone in gender representation in Indian police forces."
      },
      {
        "questionText": "What is the name and mascot of the Asia Rugby Under-20 (Sevens) Championship hosted by Bihar?",
        "options": [
          "Tiger; Shera",
          "Rabbit; Ashoka",
          "Horse; Chetak",
          "Lion; Singham"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Bihar is hosting the Asia Rugby Under-20 (Sevens) Championship for the first time in Rajgir. The mascot is a rabbit named Ashoka, symbolizing speed and agility. The event will see participation from nine Asian nations, including India."
      },
      {
        "questionText": "Which Indian port has become the first to produce Green Hydrogen and surpass 1MW solar power capacity?",
        "options": [
          "Jawaharlal Nehru Port Trust",
          "Cochin Port",
          "VOC Port",
          "Kandla Port"
        ],
        "correctAnswerIndex": 2,
        "explanation": "VOC Port has achieved two major milestones: producing Green Hydrogen and surpassing 1MW of solar power generation capacity, becoming the first Indian port to do so. This aligns with India's broader push towards renewable energy and sustainability goals."
      },
      {
        "questionText": "NPCI’s new UPI rules came into effect from which date?",
        "options": [
          "1 July 2025",
          "15 July 2025",
          "1 August 2025",
          "4 August 2025"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The National Payments Corporation of India (NPCI) implemented new rules for the Unified Payments Interface (UPI) system effective 1 August 2025. These rules include better security features and increased transaction monitoring to prevent fraud, impacting digital payments across India."
      },
      {
        "questionText": "BlueBird communication satellite, to be launched by ISRO, is developed by which country?",
        "options": [
          "India",
          "France",
          "China",
          "United States"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The BlueBird communication satellite is developed by the U.S.-based company AST SpaceMobile. It is designed for direct smartphone-to-satellite communication, enabling users to make calls and access the internet directly from space without ground towers. ISRO is planning its launch soon using its LVM3 rocket."
      },
      {
        "questionText": "Which state in India has the highest population of Mithun (Bos frontalis), a semi-domesticated bovine species?",
        "options": [
          "Assam",
          "Arunachal Pradesh",
          "Nagaland",
          "Manipur"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Arunachal Pradesh has 91% of India's Mithun population. Mithun is an important animal culturally and economically in the Northeast, and scientists are urging its inclusion under the National Livestock Mission."
      },
      {
        "questionText": "Nahargarh Wildlife Sanctuary, whose boundaries have recently been altered, is located in which state?",
        "options": [
          "Gujarat",
          "Madhya Pradesh",
          "Rajasthan",
          "Karnataka"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Nahargarh Wildlife Sanctuary is located in Rajasthan. Recent changes in its boundaries have been controversial and reportedly benefit commercial interests without proper central approval."
      },
      {
        "questionText": "Who was honoured with the 43rd Lokmanya Tilak National Award in 2025?",
        "options": [
          "Amit Shah",
          "Nitin Gadkari",
          "Arvind Kejriwal",
          "Smriti Irani"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Union Minister Nitin Gadkari was awarded the 43rd Lokmanya Tilak National Award in Pune. This prestigious award is given annually for extraordinary contributions to national progress and development."
      },
      {
        "questionText": "The Telangana Police recently rescued over 7,600 children under which nationwide initiative?",
        "options": [
          "Operation Smile",
          "Operation Bachpan",
          "Operation Sahayata",
          "Operation Muskaan-XI"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Telangana Police rescued more than 7,600 children as part of Operation Muskaan-XI, a nationwide initiative for rescuing missing and vulnerable children. The drive was carried out in coordination with various government and non-government agencies."
      },
      {
        "questionText": "Who was honoured with the 43rd Lokmanya Tilak National Award in August 2025?",
        "options": [
          "Amit Shah",
          "Nitin Gadkari",
          "Narendra Modi",
          "Manmohan Singh"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Union Minister Nitin Gadkari was honoured with the prestigious 43rd Lokmanya Tilak National Award in Pune. The award is given annually to individuals with extraordinary contributions to the nation, and Gadkari was chosen for his work in governance and promoting 'Swadeshi' (self-reliance)."
      },
      {
        "questionText": "The Indian Army recently signed an MoU for next-generation 50-ton tank transporter trailers. These trailers were developed in association with which organization?",
        "options": [
          "OFB",
          "Axiscades Aerospace",
          "HAL",
          "DRDO"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Indian Army signed a memorandum of understanding with Axiscades Aerospace for indigenously developed 50-ton tank transporter trailers, enhancing military logistics and self-reliance in defense manufacturing."
      },
      {
        "questionText": "Which film won the Best Feature Film at the 71st National Film Awards announced in August 2025?",
        "options": [
          "Jawan",
          "12th Fail",
          "The Kerala Story",
          "Pathaan"
        ],
        "correctAnswerIndex": 1,
        "explanation": "‘12th Fail’, directed by Vidhu Vinod Chopra and starring Vikrant Massey, was named Best Feature Film at the 71st National Film Awards for the year 2023. Shah Rukh Khan and Vikrant Massey shared the award for Best Actor."
      },
      {
        "questionText": "Who won the inaugural Chess Esports World Cup held in 2025?",
        "options": [
          "Hikaru Nakamura",
          "Alireza Firouzja",
          "Magnus Carlsen",
          "Viswanathan Anand"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Norwegian grandmaster Magnus Carlsen, the world No.1, won the first-ever Chess Esports World Cup by defeating Alireza Firouzja in the final, marking another milestone in his illustrious career."
      },
      {
        "questionText": "How did India’s men’s and women’s table tennis teams qualify for the 2026 World Table Tennis Championships in London?",
        "options": [
          "By winning the Asian Games",
          "By wild card entry",
          "By topping the South Asia Regional Championships",
          "By world rankings"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Both Indian men’s and women’s table tennis teams secured direct qualification for the 2026 World Table Tennis Championships in London by emerging undefeated champions at the South Asia Regional Championships held in Kathmandu."
      }
    ],
    "📆 Current Affairs – August 3, 2025": [
      {
        "questionText": "Which film won the Best Feature Film award at the 71st National Film Awards for 2023?",
        "options": [
          "Jawan",
          "Mrs. Chatterjee Vs Norway",
          "12th Fail",
          "Giddh – The Scavenger"
        ],
        "correctAnswerIndex": 2,
        "explanation": "At the 71st National Film Awards (2023), '12th Fail' won the Best Feature Film award. Directed by Vidhu Vinod Chopra, the film highlights themes of resilience and social mobility. The National Film Awards, established in 1954, are presented by the President of India to recognize excellence in Indian cinema annually."
      },
      {
        "questionText": "What is the primary function of the Investor Education and Protection Fund Authority (IEPFA)?",
        "options": [
          "Regulating stock market investments",
          "Administering unclaimed dividends and shares to rightful investors",
          "Providing loans to investors",
          "Setting up financial institutions in rural India"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Investor Education and Protection Fund Authority (IEPFA), functioning under the Ministry of Corporate Affairs since 2016, manages the IEPF. It processes claims for unclaimed shares, matured deposits, and dividends. It also promotes investor awareness and financial literacy through initiatives like Niveshak Didi, Panchayat, and Shivir."
      },
      {
        "questionText": "Why is the Alpine Musk Deer classified as endangered?",
        "options": [
          "Due to poaching for its muskpod",
          "Due to natural habitat expansion",
          "Because of low gestation period",
          "Due to overgrazing by domestic animals"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The Alpine Musk Deer is classified as 'Endangered' under IUCN and listed in Schedule I of the Wildlife Protection Act, 1972. It is poached primarily for its muskpod, used in perfumes and traditional medicines. The deer is unique as it lacks antlers and has fangs instead, making conservation efforts critical."
      },
      {
        "questionText": "What is the financial assistance provided to eligible farmers under the PM-KISAN scheme?",
        "options": [
          "₹8,000 annually in two instalments",
          "₹5,000 annually in one instalment",
          "₹6,000 annually in three instalments",
          "₹4,000 annually in four instalments"
        ],
        "correctAnswerIndex": 2,
        "explanation": "PM-KISAN is a Central Sector Scheme launched in 2019, providing ₹6,000 per year to landholding farmer families in three equal instalments of ₹2,000 each. The funds are directly transferred through DBT. Exclusion criteria include institutional landholders and professionals like doctors and engineers."
      },
      {
        "questionText": "What is the key objective of the National Critical Mineral Mission (NCMM)?",
        "options": [
          "Promote traditional mining methods",
          "Encourage exports of coal",
          "Create job opportunities in fossil fuel industries",
          "Ensure availability and processing of critical minerals"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The NCMM was launched to secure the supply of critical minerals vital for clean energy technologies such as solar panels, wind turbines, EVs, and batteries. The Ministry of Mines has designated 7 Centres of Excellence, including IITs and CSIR labs, to lead R&D under this mission using a hub-and-spoke model."
      },
      {
        "questionText": "Which Article of the Indian Constitution mandates the election of the Vice-President through proportional representation by single transferable vote?",
        "options": [
          "Article 66(1)",
          "Article 324",
          "Article 67",
          "Article 68(2)"
        ],
        "correctAnswerIndex": 0,
        "explanation": "Article 66(1) of the Indian Constitution provides that the Vice-President is elected through a system of proportional representation by means of the single transferable vote and by secret ballot. The election is conducted by the Election Commission of India and includes both elected and nominated members of Parliament in the electoral college."
      },
      {
        "questionText": "Which of the following is a new feature introduced under the updated UPI rules effective from August 1, 2025?",
        "options": [
          "Offline UPI QR scanning through NFC",
          "Linking Aadhaar to bank accounts directly",
          "UPI transfer limit increased to ₹5 lakh",
          "Users can find accounts linked to their mobile number by a specific provider"
        ],
        "correctAnswerIndex": 3,
        "explanation": "One of the significant changes in the new UPI rules effective from August 1, 2025, is the ability of users to discover all accounts linked to their mobile number through a specific payment service provider. The new rules apply to all UPI apps and regulate features like balance inquiry, autopay, and account access."
      },
      {
        "questionText": "What is the main objective of the UN-India Global Capacity Building Initiative launched in September 2023?",
        "options": [
          "To finance infrastructure in developing countries",
          "To promote Indian culture globally",
          "To share India’s development experiences with the Global South",
          "To help UN member states implement counter-terrorism strategies"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The UN-India Global Capacity Building Initiative, launched in 2023, aims to share India’s development expertise with countries in Asia, Africa, and the Caribbean. It promotes capacity building for Sustainable Development Goals (SDGs) through the UN India SDG Country Fund and India's ITEC program."
      },
      {
        "questionText": "What are 'Landraces' as recently highlighted in Odisha’s agricultural roadmap?",
        "options": [
          "Commercial hybrid seeds imported from the US",
          "Government-certified genetically modified seeds",
          "Forest crops grown without human intervention",
          "Traditional crop varieties evolved through farmer practices and natural selection"
        ],
        "correctAnswerIndex": 3,
        "explanation": "Landraces are traditional, genetically diverse crop varieties developed by farmers over generations. They are adapted to local conditions and known for traits like pest resistance, yield stability, and nutritional value. Odisha has launched a plan to integrate them into formal seed systems, addressing genetic erosion concerns."
      },
      {
        "questionText": "What is a key benefit of the Aadhaar-based Face Authentication service launched by India Post Payments Bank (IPPB)?",
        "options": [
          "Only applicable for corporate accounts",
          "Enables faster, inclusive banking without fingerprint or OTP",
          "Replaces Aadhaar with PAN for KYC",
          "Used only for government employees"
        ],
        "correctAnswerIndex": 1,
        "explanation": "India Post Payments Bank (IPPB) introduced Aadhaar-based Face Authentication to enable customers to access banking services using facial recognition. Developed under UIDAI's framework, this feature improves financial inclusion by removing the need for fingerprints or OTPs, especially beneficial for the elderly and differently-abled."
      },
      {
        "questionText": "Which of the following companies is among the 26 major tech firms that signed the EU Commission’s AI Code of Practice on GPAI?",
        "options": [
          "Tata Consultancy Services",
          "Adobe",
          "Microsoft",
          "Infosys"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Microsoft is one of the 26 major tech companies, including Amazon, Google, and IBM, that voluntarily signed the EU Commission’s AI Code of Practice on General-Purpose AI (GPAI)."
      },
      {
        "questionText": "What is a key feature of the EU AI Act?",
        "options": [
          "Complete ban on AI technologies",
          "Single uniform rule for all AI types",
          "Risk-based regulation of AI applications",
          "No legal penalties for non-compliance"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The EU AI Act adopts a risk-based approach to regulation, applying different rules depending on the level of risk posed by an AI system. This makes it the world’s first comprehensive AI law."
      },
      {
        "questionText": "Which initiative aims to develop a skilled, safe, and trustworthy AI ecosystem in India?",
        "options": [
          "Bharat AI Framework",
          "IndiaAI Mission",
          "Digital Bharat Yojana",
          "SmartAI India Scheme"
        ],
        "correctAnswerIndex": 1,
        "explanation": "IndiaAI Mission is the central government initiative designed to support innovation, skills, safety, and trust in India's AI ecosystem, rather than introducing a dedicated AI law."
      },
      {
        "questionText": "According to a study by the Bose Institute, which toxic metals were found in non-precipitating clouds over the Eastern Himalayas and Western Ghats?",
        "options": [
          "Cadmium, copper, zinc, chromium",
          "Mercury, lead, barium, arsenic",
          "Sodium, potassium, sulfur, iron",
          "Nickel, molybdenum, selenium, silver"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The study revealed the presence of cadmium (Cd), copper (Cu), zinc (Zn), and chromium (Cr) in low-level clouds, particularly over the Eastern Himalayas, which had 1.5 times more pollution."
      },
      {
        "questionText": "Which of the following statements about heavy metals (HMs) is correct?",
        "options": [
          "They have atomic weights under 30 and densities below 1000 kg/m³",
          "They are harmless to human health and occur only in industrial zones",
          "They are synthetic elements and not found in the Earth's crust",
          "They have high atomic weights and densities, and some are extremely toxic"
        ],
        "correctAnswerIndex": 3,
        "explanation": "Heavy metals are elements with high atomic weight (63.5–200.6) and densities over 4000 kg/m³. Many, such as cadmium and lead, are highly toxic and pose severe environmental and health risks."
      },
      {
        "questionText": "According to UNCTAD’s Global Trade Update, what percentage of global plastic production is traded internationally as of 2022?",
        "options": [
          "78%",
          "45%",
          "62%",
          "89%"
        ],
        "correctAnswerIndex": 0,
        "explanation": "UNCTAD reported that in 2022, over 78% of the plastic produced globally was traded internationally, indicating its significant role in global commerce despite environmental concerns."
      },
      {
        "questionText": "Which of the following statements about global plastic use and waste is true as per UNCTAD’s report?",
        "options": [
          "Half of all plastics are recycled globally.",
          "Only 10% of plastics are recycled; about 75% becomes waste.",
          "Most plastic trade involves reusable plastic containers.",
          "Plastic production has decreased since 2000."
        ],
        "correctAnswerIndex": 1,
        "explanation": "The report highlights that only about 10% of plastics are recycled globally, and around 75% ends up as waste, stressing the need for better waste management and sustainable alternatives."
      },
      {
        "questionText": "Which initiative prohibits Single Use Plastic (SUP) in India from July 2022?",
        "options": [
          "Swachh Bharat Abhiyan",
          "Plastic Waste Management Rules, 2021 Amendment",
          "Clean Plastic Movement",
          "Zero Plastic Policy Act"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Plastic Waste Management (PWM) Amendment Rules, 2021 prohibit Single Use Plastic (SUP) in India, effective from July 2022, as part of the effort to tackle plastic pollution at its root."
      },
      {
        "questionText": "Which environmental issue did the Supreme Court of India address in its support of Himachal Pradesh’s ban on private construction in green areas?",
        "options": [
          "River interlinking project",
          "Use of chemical pesticides in farming",
          "Environmental degradation due to unregulated tourism and infrastructure",
          "Pollution from plastic packaging"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Supreme Court upheld Himachal Pradesh’s move to prohibit private construction in green areas, citing unregulated infrastructure and tourism as causes for landslides, water shortages, and glacier retreat."
      },
      {
        "questionText": "What does the 2024 Plastic Waste Management Amendment in India primarily focus on?",
        "options": [
          "Banning plastic imports",
          "Imposing GST on plastic use",
          "Encouraging plastic exports",
          "Outlining the roles of Urban Local Bodies and Panchayats"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The PWM Amendment Rules, 2024 outline the responsibilities of Urban Local Bodies and Panchayats, aiming for better grassroots governance of plastic waste handling and sustainable solid waste management."
      }
    ],
    "📆 Current Affairs – August 2, 2025": [
      {
        "questionText": "What is the role of the newly inducted Indian Navy frigate 'Himgiri' under Project 17A?",
        "options": [
          "To serve as an aircraft carrier",
          "To operate unmanned underwater vehicles",
          "To protect the fleet from underwater and sea-based threats",
          "To provide satellite surveillance support"
        ],
        "correctAnswerIndex": 2,
        "explanation": "‘Himgiri’ is the third advanced guided-missile frigate under the Nilgiri Class (Project 17A). These frigates are designed to protect other ships in the fleet, especially from threats like submarines and sea-based attacks. Equipped with BrahMos supersonic missiles and Barak 8 missile systems, Himgiri is a stealth and modern warfare-ready ship. Project 17A is an indigenous follow-up to the Shivalik-class frigates."
      },
      {
        "questionText": "What is the primary aim of the DTOL project recently mentioned in global biodiversity efforts?",
        "options": [
          "To digitize land ownership records",
          "To develop drought-resistant crops",
          "To monitor desertification in tropical zones",
          "To sequence the genomes of 70,000 eukaryotic species"
        ],
        "correctAnswerIndex": 3,
        "explanation": "DTOL, or the Darwin Tree of Life project, aims to sequence the genomes of 70,000 species of eukaryotic organisms in Britain and Ireland. It is part of the broader Earth BioGenome Project (EBP), which globally seeks to catalog the genetic blueprint of all eukaryotic life (organisms with a nucleus and organelles) over ten years. This initiative is key for conservation and evolutionary biology research."
      },
      {
        "questionText": "What is the function of the Indo-Burma Ramsar Regional Initiative (IBRRI)?",
        "options": [
          "To support Ramsar Convention goals for wetland conservation",
          "To manage border disputes in Southeast Asia",
          "To coordinate agricultural reforms in the Indo-Burma region",
          "To develop ecotourism corridors in wetland regions"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The IBRRI supports the implementation of the Ramsar Convention’s Strategic Plan (2025–2030) by helping conserve and restore wetlands across member countries like Cambodia, Laos, Myanmar, Thailand, and Vietnam. It is coordinated with support from IUCN and its BRIDGE project, which promotes dialogue and governance in shared water resources."
      },
      {
        "questionText": "Why has the National Medical Commission directed hospitals to collect the ABHA ID during patient registration?",
        "options": [
          "To monitor income tax compliance",
          "To eliminate manual record keeping",
          "To track vaccination history",
          "To uniquely identify patients in India's digital healthcare system"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The ABHA ID is a 14-digit unique identifier under the Ayushman Bharat Digital Mission (ABDM). The National Medical Commission has mandated its collection during patient registration to integrate health records across the nation. It enables seamless access to medical histories and services while maintaining patient privacy with voluntary opt-out options."
      },
      {
        "questionText": "Under what provision are Additional Judges appointed in Indian High Courts?",
        "options": [
          "Article 123",
          "Article 224",
          "Article 217",
          "Article 324"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Additional Judges in High Courts are appointed under Article 224 of the Indian Constitution when there is a temporary increase in judicial workload or arrears. These judges are appointed for a term not exceeding two years and must retire by age 62. They are appointed in consultation with the Chief Justice of India, and the strength of judges is divided 75:25 between Permanent and Additional Judges."
      },
      {
        "questionText": "What role does the ancient protein 'flagellin' play in human health, as discovered by Duke University researchers?",
        "options": [
          "Enhances memory function",
          "Regulates sleep-wake cycles",
          "Signals appetite regulation via the gut-brain axis",
          "Aids in calcium absorption"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Flagellin is a protein released from bacterial flagella within the human gut microbiome. Specialized gut cells called neuropods detect this protein through TLR5 receptors and send signals to the brain via the vagus nerve. This gut-brain interaction helps regulate appetite and may have implications for treating obesity, depression, and anxiety."
      },
      {
        "questionText": "Which of the following works was authored by Goswami Tulsidas, the Vaishnav saint remembered on his 500th birth anniversary?",
        "options": [
          "Bhagavad Gita",
          "Ramcharit Manas",
          "Mahabharata",
          "Ashtadhyayi"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Goswami Tulsidas, born in Banda district of Uttar Pradesh, was a 16th-century saint and poet. He is best known for writing ‘Ramcharit Manas’ in Awadhi, which made the story of Lord Rama accessible to common people. He also authored Dohavali, Vinaya Patrika, Gitavali, and Krishnavali. His writings were pivotal in popularizing Bhakti literature during the Mughal period."
      },
      {
        "questionText": "What is the objective of the Pradhan Mantri Kisan Sampada Yojana (PMKSY), which received an additional outlay for 2021–2026?",
        "options": [
          "To provide subsidies to marginal farmers for fertilizers",
          "To enhance food processing infrastructure from farm gate to retail",
          "To offer insurance for perishable agricultural goods",
          "To provide direct income support to farmers"
        ],
        "correctAnswerIndex": 1,
        "explanation": "PMKSY is a central sector scheme launched in 2017–18 by the Ministry of Food Processing Industries. Its objective is to develop modern infrastructure and efficient supply chains for the food processing sector—from the farm gate to the retail outlet. The Cabinet recently approved an additional outlay of ₹6,520 crore under the scheme for the 15th Finance Commission cycle. It includes components like ICCVAI, FSQAI, Agro Processing Clusters, and Operation Greens."
      },
      {
        "questionText": "What is the purpose of the ₹1,000 crore allocation under the ICCVAI component of PMKSY?",
        "options": [
          "To provide agricultural loans to farmers",
          "To construct storage godowns for grains",
          "To establish Multi Product Food Irradiation Units",
          "To expand organic farming clusters"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Integrated Cold Chain and Value Addition Infrastructure (ICCVAI) component under PMKSY has been allocated ₹1,000 crore to set up 50 Multi Product Food Irradiation Units. These units are critical for enhancing the shelf life of food, reducing wastage, and ensuring food safety. They support the overall aim of the scheme to improve infrastructure in food processing."
      },
      {
        "questionText": "Which company recently received a license to provide satellite internet services in India?",
        "options": [
          "OneWeb",
          "Amazon Kuiper",
          "Starlink",
          "Google Fiber"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Starlink, a satellite internet service project by SpaceX, has received regulatory approval to operate in India. Starlink aims to provide high-speed, location-independent internet using a constellation of satellites in Low Earth Orbit. It is expected to bridge the digital divide by serving remote and rural regions, especially in difficult terrains like Siachen and the Northeast. However, it faces challenges such as high cost, bandwidth limits, and regulatory issues."
      },
      {
        "questionText": "What is the significance of the newly discovered CRIB blood group?",
        "options": [
          "It is the most common blood group in India",
          "It lacks any surface antigen",
          "It is associated with a rare disease found in Bengaluru",
          "It is a rare blood group system linked to the CD55 protein"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The CRIB blood group is a newly discovered rare blood type found in India. It is associated with antigens carried on the CD55 protein, also called Decay Accelerating Factor (DAF), which belongs to the Cromer (CR) blood group system. It includes 12 high-prevalence and 3 low-prevalence antigens. The name 'CRIB' reflects its origin: 'CR' for Cromer and 'IB' for India, Bengaluru, where it was identified. This is significant for transfusion medicine and genetic studies."
      },
      {
        "questionText": "In the 2025 case Padi Kaushik Reddy v. State of Telangana, what directive did the Supreme Court give regarding disqualification petitions?",
        "options": [
          "The Speaker must refer all disqualification cases to the Election Commission",
          "Petitions must be decided within 30 days from filing",
          "The Speaker must conclude proceedings within three months from July 31, 2025",
          "Disqualification petitions should be handled by the High Court only"
        ],
        "correctAnswerIndex": 2,
        "explanation": "In Padi Kaushik Reddy v. State of Telangana (2025), the Supreme Court criticized the inordinate delay in deciding disqualification petitions and ordered the Telangana Speaker to conclude proceedings within three months from July 31, 2025. The court emphasized that prolonged delays defeat the purpose of the Tenth Schedule, referring to the situation as ‘operation successful, patient died’."
      },
      {
        "questionText": "Which judgment previously recommended replacing the Speaker with an independent tribunal for handling disqualification petitions?",
        "options": [
          "Keisham Meghachandra Singh Case (2020)",
          "Kihoto Hollohan v. Zachillhu (1992)",
          "Padi Kaushik Reddy v. State of Telangana (2025)",
          "Rameshwar Prasad v. Union of India (2006)"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The Keisham Meghachandra Singh Case (2020) held that Speakers must decide disqualification petitions within three months and suggested that an independent tribunal should handle such matters instead of the Speaker. The case was pivotal in reform discussions around the Anti-Defection Law and the Tenth Schedule."
      },
      {
        "questionText": "What is one of the key investment-focused recommendations of the White Paper on India’s Blue Economy?",
        "options": [
          "Mandating 100% FDI in all marine projects",
          "Establishing a blue economy SEBI regulator",
          "Issuing blue bonds and promoting PPPs for marine sector investment",
          "Nationalising deep-sea fishing operations"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The White Paper on Blue Economy outlines a roadmap till 2035 and recommends attracting investment via instruments like blue bonds, blended finance, and Public-Private Partnerships (PPPs). These steps aim to unlock the potential of India's marine and coastal resources as a core part of Viksit Bharat 2047."
      },
      {
        "questionText": "Under the Tenth Schedule of the Indian Constitution, which of the following is a valid ground for disqualification?",
        "options": [
          "Voting in favor of a private member's bill as an independent",
          "Voluntarily giving up party membership",
          "Failure to attend three consecutive House sessions",
          "Crossing the floor during a debate"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Tenth Schedule, inserted by the 52nd Constitutional Amendment in 1985, disqualifies legislators who voluntarily give up party membership, defy the party whip, or join a party (in case of independents and nominated members under specific conditions). It aims to prevent political defections and strengthen democratic stability."
      },
      {
        "questionText": "What is the key objective of the 'Grant in Aid to National Cooperative Development Corporation' Scheme approved by the Cabinet?",
        "options": [
          "To fund cooperative banks for rural microloans",
          "To subsidize fertilizers and seeds for farmers",
          "To provide loans to cooperatives for setting up or expanding projects and meeting working capital needs",
          "To support direct cash transfers to cooperative members"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The 'Grant in Aid to NCDC' Scheme aims to provide loans to cooperatives for establishing new projects, modernizing or expanding existing facilities, and meeting working capital requirements. It is a Central Sector Scheme with an outlay of ₹2,000 crore over four years, enabling the NCDC to mobilize an additional ₹20,000 crore from the open market."
      },
      {
        "questionText": "How will the National Cooperative Development Corporation (NCDC) use the ₹2,000 crore grant under the new scheme?",
        "options": [
          "To raise ₹20,000 crore from the open market for cooperative financing",
          "To directly provide subsidies to cooperative societies",
          "To waive loans taken by cooperatives before 2020",
          "To create new cooperative ministries in each state"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The ₹2,000 crore grant-in-aid provided to the NCDC will be utilized to raise ₹20,000 crore from the open market. This funding will support long-term project credit and working capital for cooperatives across sectors to promote modernization, profitability, and job creation."
      },
      {
        "questionText": "Which ministry is responsible for the implementation of the National Cooperative Development Corporation (NCDC) Scheme?",
        "options": [
          "Ministry of Agriculture and Farmers' Welfare",
          "Ministry of Finance",
          "Ministry of Cooperation",
          "Ministry of Rural Development"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Ministry of Cooperation oversees the National Cooperative Development Corporation (NCDC). The NCDC was established in 1963 and plays a key role in promoting cooperative-based production, marketing, and processing in agriculture and allied sectors."
      },
      {
        "questionText": "Which of the following is a key application of Green Hydrogen?",
        "options": [
          "Used as raw material in textile dyeing",
          "Powering hydrogen fuel cell vehicles like trucks and buses",
          "Enhancing solar cell efficiency",
          "Carbon capture from coal-based power plants"
        ],
        "correctAnswerIndex": 1,
        "explanation": "Green Hydrogen is used in hydrogen fuel cells to power trucks, buses, and other vehicles. It is also applied in steel production, fertilizer plants, and as a grid-balancing tool. It is produced by electrolysis using renewable electricity, making it a clean energy alternative."
      },
      {
        "questionText": "What is the production target of Green Hydrogen under India’s National Green Hydrogen Mission by 2030?",
        "options": [
          "1 MMT per annum",
          "3 MMT per annum",
          "5 MMT per annum",
          "10 MMT per annum"
        ],
        "correctAnswerIndex": 2,
        "explanation": "Under the National Green Hydrogen Mission, India has set an ambitious target to produce 5 million metric tonnes (MMT) of Green Hydrogen per annum by 2030. The mission aims to make India a global hub for green hydrogen production, usage, and export, and is managed by the Ministry of New and Renewable Energy."
      }
    ],
    "📆 Current Affairs – August 1, 2025": [
      {
        "questionText": "During the India-UAE Joint Defence Cooperation Committee (JDCC) meeting, which of the following was reaffirmed?",
        "options": [
          "Signing of a free trade agreement",
          "Joint lunar exploration mission",
          "Deepening of defence partnership",
          "Exchange of rare earth minerals"
        ],
        "correctAnswerIndex": 2,
        "explanation": "India and the United Arab Emirates (UAE) held a high-level meeting of the Joint Defence Cooperation Committee (JDCC) in New Delhi, where both nations reaffirmed their intention to strengthen defence cooperation. This includes increased joint training, technology transfer, maritime security, and defence industrial collaboration. The UAE is a key partner for India in the Gulf region, and both countries share strategic interests in counterterrorism, trade security, and energy routes. This defence alignment complements their growing economic and diplomatic ties."
      },
      {
        "questionText": "Which geographical feature contributes to the UAE’s strategic importance in global crude oil transit?",
        "options": [
          "Location near the Tropic of Capricorn",
          "Presence of high mountains in the west",
          "Border with the Mediterranean Sea",
          "Strategic location along the Strait of Hormuz"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The UAE is strategically located near the Strait of Hormuz, one of the world's most important oil transit chokepoints. Around one-third of global seaborne oil passes through this narrow strait between the Persian Gulf and the Gulf of Oman. This makes the UAE (especially emirates like Abu Dhabi and Dubai) crucial for international energy security. In addition, its proximity to key maritime routes enhances its influence in global shipping, trade, and defence strategies. Its desert geography and tropical climate are also notable features."
      },
      {
        "questionText": "What do the Supply and Use Tables (SUTs) released by the Ministry of Statistics and Programme Implementation aim to integrate?",
        "options": [
          "All three GDP approaches – production, income, and expenditure",
          "Census and voter data",
          "Trade and demographic data",
          "Fiscal and monetary policy indicators"
        ],
        "correctAnswerIndex": 0,
        "explanation": "The Ministry of Statistics and Programme Implementation (MoSPI) released the updated Supply and Use Tables (SUTs) for 2020–21 and 2021–22, which provide a comprehensive snapshot of the economy. The SUTs consist of two matrices: the Supply Table (how much is produced) and the Use Table (how it is used across industries and final demand). These tables integrate three approaches to calculating Gross Domestic Product (GDP): production, income, and expenditure. This ensures consistency in national accounts and is based on data from surveys like the Annual Survey of Industries (ASI) and National Accounts Statistics (NAS) 2024."
      },
      {
        "questionText": "Which of the following is a key change introduced by the Banking Laws (Amendment) Act, 2025?",
        "options": [
          "Abolition of statutory auditors for PSBs",
          "Introduction of cryptocurrency regulation",
          "Merger of public and private banks",
          "Raising the substantial interest limit from ₹5 lakh to ₹2 crore"
        ],
        "correctAnswerIndex": 3,
        "explanation": "The Banking Laws (Amendment) Act, 2025—enforced from August 1—brought significant changes to modernize banking regulations in India. One key update is raising the 'substantial interest' threshold from ₹5 lakh to ₹2 crore for directors and stakeholders. This is the first such revision since 1968. Other changes include improving governance in cooperative banks by extending director tenures (excluding chairpersons) and enabling Public Sector Banks (PSBs) to transfer unclaimed shares/funds to the Investor Education and Protection Fund (IEPF), thus enhancing transparency and investor protection."
      },
      {
        "questionText": "What eligibility condition must an officer fulfill to be considered for the post of State DGP under the Single Window System?",
        "options": [
          "Must be under 50 years of age",
          "Must have minimum 30 years of service",
          "Must be serving in the Ministry of Home Affairs",
          "Must have prior international policing experience"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Centre introduced a Single Window System for appointing State Directors General of Police (DGPs) to bring uniformity and transparency. This follows the Supreme Court's 2006 verdict in the Prakash Singh case and 2009 UPSC guidelines. Under this process, states must send a list of eligible officers—each with at least 30 years of service—to UPSC six months before the current DGP retires. Officers nearing retirement (less than 6 months left) are not eligible. UPSC then shortlists 2–3 officers based on merit, from which the state makes the final appointment."
      },
      {
        "questionText": "What is a key reason for updating the base year for GDP, IIP, and CPI to more recent years like 2022–23 and 2024?",
        "options": [
          "To adjust for foreign exchange fluctuations",
          "To align with global tax norms",
          "To capture structural changes and real economic growth",
          "To reduce fiscal deficit figures"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The government is updating the base year for key economic indicators like GDP (to 2022–23), Index of Industrial Production (IIP), and Consumer Price Index (CPI) to better reflect changes in economic structure, consumption patterns, and sectoral weights. A newer base year allows for a more accurate measurement of real economic growth by removing inflation effects and incorporating alternative data sources like GST, UPI, and e-Vahan data."
      },
      {
        "questionText": "Which mission has disbursed over ₹11 lakh crore in loans to Self-Help Groups (SHGs), particularly benefiting rural women?",
        "options": [
          "PM Awas Yojana – Rural",
          "Deendayal Antyodaya Yojana – NRLM",
          "National Digital Health Mission",
          "Start-Up India Mission"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Deendayal Antyodaya Yojana – National Rural Livelihoods Mission (DAY-NRLM), under the Ministry of Rural Development, has enabled the disbursement of over ₹11 lakh crore in loans to women-led SHGs. The mission empowers rural women through enterprise support, training, and credit access. It also introduces innovations like Banking Correspondent Sakhis and promotes inclusive development via Social Behaviour Change Communication (SBCC)."
      },
      {
        "questionText": "What are the Piprahwa Relics, recently returned to India, historically associated with?",
        "options": [
          "Ashoka’s rock edicts",
          "Vedic ritual fire altars",
          "Mortal remains of Lord Buddha",
          "Ancient Gupta coinage"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Piprahwa Relics consist of bone fragments and ornate containers believed to be the mortal remains of Lord Buddha. Discovered in 1898 by William Claxton Peppé in present-day Siddharthnagar, Uttar Pradesh (ancient Kapilavastu), they are classified as 'AA' antiquities under Indian law. Inscriptions in Brahmi script confirm that they were deposited by the Sakya clan, making them historically and spiritually significant."
      },
      {
        "questionText": "Which group was confirmed by the UNSC 1267 Committee as being behind the recent Pahalgam terror attack?",
        "options": [
          "The Resistance Front (TRF)",
          "Jaish-e-Mohammed",
          "Islamic State – Khorasan Province",
          "Al Qaeda in the Indian Subcontinent"
        ],
        "correctAnswerIndex": 0,
        "explanation": "A UN Security Council Monitoring Team under the 1267 Sanctions Committee confirmed that the Pahalgam terror attack was carried out by The Resistance Front (TRF), a proxy of Pakistan-based Lashkar-e-Taiba (LeT). This report is significant as it was adopted unanimously, including by Pakistan. The 1267 Committee mandates all UN member states to take action against listed terrorist groups and individuals."
      },
      {
        "questionText": "What constitutional right did the Supreme Court uphold in the UPP Tollways v. MP Road Development Corp. case?",
        "options": [
          "Right to vote in urban areas",
          "Right to privacy on toll roads",
          "Right to free inter-state transport",
          "Right to safe and motorable roads"
        ],
        "correctAnswerIndex": 3,
        "explanation": "In a landmark ruling, the Supreme Court of India held that the right to safe and motorable roads is a fundamental right under Article 21 (right to life) and Article 19(1)(g) (freedom of movement). The court clarified that the responsibility of maintaining roads lies with the state, not private contractors. This judgment emphasizes the State's duty to ensure public infrastructure aligns with basic constitutional rights."
      },
      {
        "questionText": "What is the primary objective of India’s resolution on 'Promoting Sustainable Lifestyles for Wetlands' adopted by 172 countries?",
        "options": [
          "Promote industrial development near wetlands",
          "Align wetland conservation with Mission LiFE principles",
          "Convert wetlands into national parks",
          "Introduce large-scale tourism around wetlands"
        ],
        "correctAnswerIndex": 1,
        "explanation": "India’s resolution promotes the sustainable conservation of wetlands and aligns with Mission LiFE (Lifestyle for Environment). It emphasizes environmentally conscious living and seeks to engage individuals and communities to adopt eco-friendly habits that protect wetlands."
      },
      {
        "questionText": "What is meant by 'wise use' of wetlands under the Ramsar Convention?",
        "options": [
          "Commercial development of wetlands",
          "Use of wetlands for intensive farming",
          "Maintaining ecological character through sustainable development",
          "Conversion of wetlands into urban spaces"
        ],
        "correctAnswerIndex": 2,
        "explanation": "The Ramsar Convention defines 'wise use' as maintaining the ecological character of wetlands using sustainable, ecosystem-based approaches. It emphasizes long-term conservation that benefits both people and nature."
      },
      {
        "questionText": "What recent initiative has India launched to guide wetland management based on the Ramsar principle of 'wise use'?",
        "options": [
          "Wetlands Revival Act, 2025",
          "National Eco Wetland Mission",
          "Wetland Wise Use – An Implementation Framework",
          "Mission Jal Suraksha"
        ],
        "correctAnswerIndex": 2,
        "explanation": "India’s 2024 framework titled 'Wetland Wise Use – An Implementation Framework' outlines national strategies to manage wetlands sustainably, in line with Ramsar principles. It includes community participation programs like 'Mission Sahbhagita' and 'Save Wetlands'."
      },
      {
        "questionText": "What percentage of global freshwater use is attributed to global food systems, as reported in the UNFSS+4 Stocktake?",
        "options": [
          "70%",
          "30%",
          "50%",
          "90%"
        ],
        "correctAnswerIndex": 0,
        "explanation": "Global food systems are responsible for about 70% of global freshwater use. They also contribute to over 30% of global emissions and 80% of biodiversity loss, highlighting the need for urgent reform in how food is produced, processed, and consumed."
      },
      {
        "questionText": "Which of the following initiatives aims to reform food systems at the global level by linking them with climate strategies?",
        "options": [
          "UNESCO Food Heritage Pact",
          "Apulia Food Systems Initiative (G7)",
          "World Climate Agriculture Network",
          "COP11 Kyoto Food Charter"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The Apulia Food Systems Initiative, launched by the G7, is a key global effort to reform food systems by linking them with climate policies. It complements other major frameworks like the COP28 UAE Declaration and the G20 Global Alliance Against Hunger and Poverty."
      },
      {
        "questionText": "What makes the NISAR satellite mission a landmark in Indo-US space collaboration?",
        "options": [
          "It is the first interplanetary mission between India and the US",
          "It is the first mission to use nuclear propulsion",
          "It is the first dual-frequency radar Earth observation mission",
          "It is India's first satellite launched from US soil"
        ],
        "correctAnswerIndex": 2,
        "explanation": "NISAR is the world’s first Earth Observation Satellite to use dual-frequency Synthetic Aperture Radar (SAR) – L-band by NASA and S-band by ISRO. This marks a significant milestone in Indo-US collaboration in space-based Earth monitoring."
      },
      {
        "questionText": "Which ISRO launch vehicle placed the NISAR satellite into a Sun-Synchronous Orbit for the first time?",
        "options": [
          "PSLV-C59",
          "GSLV-F16",
          "SSLV-D3",
          "GSLV Mk III"
        ],
        "correctAnswerIndex": 1,
        "explanation": "GSLV-F16 was used to launch the NISAR satellite into a Sun-Synchronous Polar Orbit. This is the first time a GSLV was used for this type of orbit, as it is typically meant for placing satellites into Geosynchronous Transfer Orbit (GTO)."
      },
      {
        "questionText": "What is a unique technical feature of NISAR that allows it to generate wide-swath, high-resolution radar images?",
        "options": [
          "Laser Interferometry",
          "Time-Delay Integration",
          "Multi-Orbit Reflection Imaging",
          "SweepSAR technique"
        ],
        "correctAnswerIndex": 3,
        "explanation": "NISAR uses the SweepSAR technique to produce wide-swath, high-resolution radar images. This advanced radar mode improves coverage and detail for terrain mapping and environmental monitoring."
      },
      {
        "questionText": "Why did the United States impose a 25% tariff and penalty on Indian exports effective from August 1, 2025?",
        "options": [
          "India refused to reduce import tariffs on US weapons",
          "India's BRICS alignment and trade with Russia",
          "Failure of India to join the Indo-Pacific Economic Framework",
          "India’s non-cooperation in Arctic research missions"
        ],
        "correctAnswerIndex": 1,
        "explanation": "The US imposed a 25% tariff and an unspecified penalty citing India's continued defense and energy ties with Russia and its strategic alignment with BRICS, which is seen as anti-dollar. Other factors include trade barriers like agricultural subsidies and SPS measures."
      },
      {
        "questionText": "What is one major economic implication of the new US tariffs on India’s global trade competitiveness?",
        "options": [
          "Increase in foreign direct investment",
          "Rise in rupee valuation",
          "Competitive disadvantage compared to countries like Vietnam",
          "Surge in Indian pharmaceutical prices"
        ],
        "correctAnswerIndex": 2,
        "explanation": "With tariffs on Indian goods now higher (25%) compared to Vietnam (20%) and Indonesia (19%), Indian exporters face a competitive disadvantage, especially in sectors like pharmaceuticals and agriculture, impacting trade volumes and cost efficiency."
      }
    ]

  }
